import { v4 } from 'node-uuid';
import {DateTime} from 'luxon'
const date = DateTime.fromObject({
    year: Number(1999),
    month: Number(2),
    day: Number(20),
    hour: Number(20),
    minute: Number(20)
})

const fakeDatabase = {
    events: [{
        id: v4(),
        name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
        description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
        'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
        'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
        date: date,
        organization: "Добрі справи 2018",
        contacts: +38098678594,
        location:"Київська область, Київ",
    }, {
        id: v4(),
        name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
        description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
        'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
        'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
        date: date,
        organization: "Добрі справи 2018",
        contacts: +38098678594,
        location:"Київська область, Київ",
    }, {
        id: v4(),
        name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
        description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
        'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
        'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
        date: date,
        organization: "Добрі справи 2018",
        contacts: +38098678594,
        location:"Київська область, Київ",
    },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
        },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
        },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
        }],
};

const delay = (ms) =>
    new Promise(resolve =>
        setTimeout(resolve, ms));

export const fetchEvents = () =>
    delay(500).then(() => {
        return fakeDatabase.events})
