import { v4 } from 'node-uuid';
import {DateTime} from 'luxon'
const date = DateTime.fromObject({
    year: Number(1999),
    month: Number(2),
    day: Number(20),
    hour: Number(20),
    minute: Number(20)
})

let fakeDatabase = {
    events: [{
        id: v4(),
        name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
        description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
        'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
        'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
        date: date,
        organization: "Добрі справи 2018",
        contacts: +38098678594,
        location:"Київська область, Київ",
        photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",
    }, {
        id: v4(),
        name: 'Ми - діти!',
        description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\\n\' +\n' +
        ' Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\\n\' +\n' +
        ' А ще на всіх',
        date: date,
        organization: "Дитяча кімната",
        contacts: +38098678594,
        location:"Київська область, Київ",
        photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",

    }, {
        id: v4(),
        name: 'Яскрава ідея в її руках',
        description:'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n'
        ,
        date: date,
        organization: " Варіанти",
        contacts: +38098678594,
        location:"Київська область, Київ",
        photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",

    },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
            photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",

        },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
            photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",

        },
        {
            id: v4(),
            name: 'Фестивалю "Добрі справи 2018" потрібен логотип',
            description: 'Добрі справи 2018"- фестиваль, що має за мету зібрати в одному місці велику кулькість людей які займаються благодійністтю та роблять добрі справи.\n' +
            'Зокрема це будуть громадські організації та благодійні фонди, а також ініціативні групи чи люди які своїми соціальними проектами чи добрими вчинками зробили великий внесок в скарбницю добрих справ і заслуговують розказати про себе і залучити до своєї діяльності як можна більше людей з числа гостей фестивалю.\n' +
            'А ще на всіх гостей фестивалю чекатиме сюрприз в формі інтерактивнлї гри, в якій зможе взяти участь кожен і виграти подарунки від наших спонсорів та партнерів.',
            date: date,
            organization: "Добрі справи 2018",
            contacts: +38098678594,
            location:"Київська область, Київ",
            photo: "http://res.cloudinary.com/ucu/image/upload/c_scale,r_5,w_265/v1520958024/photo-event_vwr3vn.jpg",

        }],
};

const delay = (ms) =>
    new Promise(resolve =>
        setTimeout(resolve, ms));

export const fetchEvents = () =>
    delay(500).then(() => {
        return fakeDatabase.events})

export const pushEvent = (newEvent) =>
    delay(500).then(() => {
        fakeDatabase.events.push(newEvent);
        return newEvent;
    });
